# Taps

# CLI Tools - General Utilities & Power User Tools
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "coreutils"
brew "fastfetch"
brew "gh"
brew "git"
brew "gnupg"
brew "htop"
brew "lsd"
brew "mac-cleanup-py"
#brew "mas"
brew "mkdocs"
brew "moreutils"
brew "nano"
brew "nanorc"
brew "ncdu"
brew "nethogs"
brew "nmap"
brew "openssh"
brew "pandoc"
brew "paperkey"
brew "pinentry-mac"
brew "pwgen"
brew "qemu"
brew "qrencode"
brew "rclone"
brew "tealdeer"
brew "topgrade"
brew "trash"
brew "tree"
brew "watch"
brew "wget"
brew "zsh"

# Repo essentials
brew "ripgrep"
brew "shellcheck"
brew "shfmt"

# Languages / runtimes
brew "nvm"
brew "python@3.12"
brew "pipx"
brew "pyenv"
brew "openjdk"

# CLI Tools - Media
brew "ffmpeg"
brew "chromaprint"    # Core component of the AcoustID project (Audio fingerprinting)
brew "whisper-cpp"
brew "yt-dlp"

# Casks - General Applications & Utilities
cask "1password", greedy: true
cask "1password-cli"
cask "4k-video-downloader+"
cask "a-better-finder-rename", greedy: true
cask "adapter"
cask "aldente", greedy: true
cask "appcleaner", greedy: true
cask "arctic", greedy: true
cask "audio-hijack", greedy: true
cask "auto-claude"
cask "balenaetcher"
cask "brave-browser", greedy: true
cask "calibre"
cask "chatgpt", greedy: true
cask "claude", greedy: true
cask "claude-code"
cask "cryptomator"
cask "descript", greedy: true
cask "discord", greedy: true
cask "disk-drill", greedy: true
cask "dropbox", greedy: true
cask "etrecheckpro"
cask "farrago", greedy: true
cask "firefox", greedy: true
cask "fission", greedy: true
cask "folx", greedy: true
cask "github", greedy: true
cask "google-chrome", greedy: true
cask "google-chrome@canary", greedy: true
cask "google-drive", greedy: true
cask "gpg-suite-no-mail", greedy: true
cask "handbrake-app", greedy: true
cask "helium-browser", greedy: true
cask "hot", greedy: true
cask "ilok-license-manager"
cask "iterm2", greedy: true
cask "izotope-product-portal"
cask "jordanbaird-ice", greedy: true
cask "keka", greedy: true
cask "keybase", greedy: true
cask "keyboardcleantool"
cask "kid3"
cask "kobo"
cask "loopback", greedy: true
cask "losslesscut"
cask "macfuse", greedy: true
cask "macwhisper", greedy: true
cask "mdrp"
cask "mediainfo"
cask "minecraft", greedy: true
cask "musicbrainz-picard"
cask "nordvpn", greedy: true
cask "omnidisksweeper", greedy: true
cask "onyx"
cask "openaudible"
cask "openmtp"
cask "piezo", greedy: true
cask "pulsar"
cask "raspberry-pi-imager"
cask "raycast", greedy: true
cask "samsung-magician", greedy: true
cask "screenflow", greedy: true
cask "shutter-encoder"
cask "signal", greedy: true
cask "slack", greedy: true
cask "soundsource", greedy: true
cask "stats", greedy: true
cask "steam", greedy: true
cask "subler", greedy: true
cask "swift-publisher", greedy: true
cask "the-unarchiver", greedy: true
cask "timemachineeditor", greedy: true
cask "typora", greedy: true
cask "utm"
cask "veracrypt"
cask "vlc", greedy: true
cask "waves-central", greedy: true
cask "whatsapp", greedy: true
cask "zoom", greedy: true

# Mac App Store Apps
#mas "Amphetamine", id: 937984704
#mas "BetterSnapTool", id: 417375580
#mas "Blackmagic Disk Speed Test", id: 425264550
#mas "Chrono Plus", id: 946047238
#mas "Compressor", id: 424390742
#mas "Encrypto", id: 935235287
#mas "Final Cut Pro", id: 424389933
#mas "GarageBand", id: 682658836
#mas "Hush", id: 1664181766
#mas "iMovie", id: 408981434
#mas "Keynote", id: 409183694
#mas "Logic Pro", id: 634148309
#mas "NextDNS", id: 1464122853
#mas "Numbers", id: 409203825
#mas "Pages", id: 409201541
#mas "Parcel", id: 639968404
#mas "Pixelmator Pro", id: 1289583905
#mas "Pure Paste", id: 1611378436
#mas "Speedtest", id: 1153157709
