# Taps

# CLI Tools - General Utilities & Power User Tools
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "coreutils"
brew "fastfetch"
brew "gh"
brew "git"
brew "gnupg"
brew "htop"
brew "lsd"
brew "lzip"
brew "mas"
brew "moreutils"
brew "most"
brew "nano"
brew "nanorc"
brew "ncdu"
brew "nethogs"
brew "nmap"
brew "openssh"
brew "osx-cpu-temp"
brew "paperkey"
brew "pinentry-mac"
brew "pwgen"
brew "qemu"
brew "qrencode"
brew "speedtest-cli"
brew "tealdeer"
brew "topgrade"
brew "trash"
brew "watch"
brew "zip"
brew "zsh"

# ✅ Repo essentials
brew "ripgrep"
brew "shellcheck"
brew "shfmt"

# ✅ Languages / runtimes
brew "python@3.12"
brew "pipx"
brew "pyenv"
brew "openjdk"

# CLI Tools - Media
brew "ffmpeg"
brew "chromaprint"    # Core component of the AcoustID project (Audio fingerprinting)
brew "sox"

# Casks - General Applications & Utilities
cask "1password"
cask "4k-video-downloader+"
cask "a-better-finder-rename"
cask "adapter"
cask "aldente"
cask "appcleaner"
cask "audio-hijack"
cask "balenaetcher"
cask "brave-browser"
cask "calibre"
cask "cryptomator"
cask "descript"
cask "discord"
# cask "dropbox"
cask "etrecheckpro"
cask "farrago"
cask "firefox"
cask "fission"
cask "folx"
cask "github"
cask "google-chrome"
cask "google-chrome@canary"
cask "google-drive"
cask "gpg-suite-no-mail"
cask "hammerspoon"
cask "handbrake"
# cask "helium-browser"
cask "hot"
cask "ilok-license-manager"
cask "inkscape"
cask "iterm2"
cask "joplin"
cask "jordanbaird-ice"
cask "keka"
cask "keyboardcleantool"
cask "kid3"
cask "kobo"
cask "loopback"
cask "losslesscut"
cask "macfuse"
cask "macwhisper"
cask "mdrp"
cask "mediainfo"
cask "minecraft"
cask "musicbrainz-picard"
cask "nordvpn"
cask "ocenaudio"
cask "omnidisksweeper"
cask "onyx"
cask "openaudible"
cask "openmtp"
cask "piezo"
cask "pulsar"
cask "raspberry-pi-imager"
cask "raycast"
cask "signal"
cask "slack"
cask "soundsource"
cask "stats"
cask "steam"
cask "subler"
cask "the-unarchiver"
cask "timemachineeditor"
cask "typora"
cask "utm"
cask "veracrypt"
cask "vivaldi"
cask "vlc"
cask "waves-central"
cask "whatsapp"
cask "zoom"

# Mac App Store Apps
mas "Amphetamine", id: 937984704
mas "BetterSnapTool", id: 417375580
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Chrono Plus", id: 946047238
mas "Compressor", id: 424390742
mas "Encrypto", id: 935235287
mas "Final Cut Pro", id: 424389933
mas "GarageBand", id: 682658836
mas "Hush", id: 1664181766
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Logic Pro", id: 634148309
mas "NextDNS", id: 1464122853
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "Pixelmator Pro", id: 1289583905
mas "Pure Paste", id: 1611378436
mas "Speedtest", id: 1153157709
